{"keras_version": "2.0.8", "backend": "tensorflow", "class_name": "Sequential", "config": [{"class_name": "LSTM", "config": {"recurrent_regularizer": null, "unit_forget_bias": true, "kernel_regularizer": null, "units": 100, "stateful": false, "recurrent_dropout": 0.0, "use_bias": true, "kernel_constraint": null, "return_state": false, "recurrent_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "go_backwards": false, "batch_input_shape": [null, 80, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "implementation": 0, "name": "lstm_1", "dtype": "float32", "bias_constraint": null, "activation": "tanh", "recurrent_activation": "hard_sigmoid", "unroll": false, "bias_regularizer": null, "trainable": true, "dropout": 0.0, "activity_regularizer": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "return_sequences": false}}, {"class_name": "Dense", "config": {"bias_constraint": null, "units": 6, "activation": "softmax", "use_bias": true, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "bias_regularizer": null, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "name": "dense_1", "kernel_regularizer": null}}]}