{"keras_version": "2.0.8", "config": [{"class_name": "LSTM", "config": {"stateful": false, "unit_forget_bias": true, "go_backwards": false, "trainable": true, "units": 100, "bias_regularizer": null, "dropout": 0.0, "activity_regularizer": null, "recurrent_constraint": null, "unroll": false, "kernel_regularizer": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "use_bias": true, "activation": "tanh", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "kernel_constraint": null, "return_sequences": false, "name": "lstm_1", "bias_constraint": null, "recurrent_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "recurrent_dropout": 0.0, "implementation": 0, "batch_input_shape": [null, 80, 1], "return_state": false, "dtype": "float32", "recurrent_activation": "hard_sigmoid"}}, {"class_name": "Dense", "config": {"kernel_constraint": null, "units": 6, "name": "dense_1", "bias_constraint": null, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_regularizer": null, "use_bias": true, "activation": "softmax"}}], "class_name": "Sequential", "backend": "tensorflow"}