{"backend": "tensorflow", "config": [{"config": {"dtype": "float32", "stateful": false, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "unroll": false, "trainable": true, "batch_input_shape": [null, 80, 3], "bias_regularizer": null, "use_bias": true, "name": "lstm_1", "return_state": false, "recurrent_activation": "hard_sigmoid", "unit_forget_bias": true, "recurrent_dropout": 0.0, "recurrent_constraint": null, "implementation": 0, "recurrent_regularizer": null, "units": 100, "go_backwards": false, "bias_constraint": null, "return_sequences": false, "activation": "tanh", "dropout": 0.0, "activity_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null}, "class_name": "LSTM"}, {"config": {"units": 6, "use_bias": true, "activation": "softmax", "trainable": true, "bias_constraint": null, "activity_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "bias_regularizer": null, "kernel_regularizer": null, "name": "dense_1", "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Dense"}], "class_name": "Sequential", "keras_version": "2.0.8"}