{"class_name": "Sequential", "config": [{"class_name": "LSTM", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "name": "lstm_1", "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "stateful": false, "go_backwards": false, "trainable": true, "bias_regularizer": null, "return_sequences": false, "recurrent_activation": "hard_sigmoid", "kernel_regularizer": null, "dtype": "float32", "activation": "tanh", "units": 100, "activity_regularizer": null, "use_bias": true, "return_state": false, "unroll": false, "batch_input_shape": [null, 80, 3], "recurrent_regularizer": null, "recurrent_dropout": 0.0, "dropout": 0.0, "unit_forget_bias": true, "implementation": 0, "recurrent_constraint": null, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null}}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "name": "dense_1", "activity_regularizer": null, "use_bias": true, "units": 6, "trainable": true, "bias_regularizer": null, "activation": "softmax", "kernel_constraint": null, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null}}], "keras_version": "2.0.8", "backend": "tensorflow"}