{"config": [{"config": {"bias_regularizer": null, "unroll": false, "bias_constraint": null, "activation": "tanh", "trainable": true, "dropout": 0.0, "kernel_regularizer": null, "use_bias": true, "batch_input_shape": [null, 80, 3], "activity_regularizer": null, "name": "lstm_1", "stateful": false, "unit_forget_bias": true, "recurrent_constraint": null, "recurrent_dropout": 0.0, "kernel_constraint": null, "recurrent_activation": "hard_sigmoid", "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "units": 100, "recurrent_regularizer": null, "return_sequences": false, "dtype": "float32", "implementation": 0, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "return_state": false, "go_backwards": false}, "class_name": "LSTM"}, {"config": {"bias_regularizer": null, "activation": "softmax", "units": 6, "bias_constraint": null, "trainable": true, "kernel_regularizer": null, "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "name": "dense_1", "kernel_constraint": null, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}}, "class_name": "Dense"}], "backend": "tensorflow", "keras_version": "2.0.8", "class_name": "Sequential"}