{"keras_version": "2.0.8", "config": [{"config": {"name": "lstm_1", "return_sequences": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "recurrent_dropout": 0.0, "stateful": false, "units": 100, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "batch_input_shape": [null, 80, 3], "kernel_regularizer": null, "use_bias": true, "go_backwards": false, "return_state": false, "bias_constraint": null, "recurrent_constraint": null, "recurrent_activation": "hard_sigmoid", "activity_regularizer": null, "kernel_constraint": null, "trainable": true, "dtype": "float32", "implementation": 0, "unit_forget_bias": true, "unroll": false, "activation": "tanh", "dropout": 0.0, "bias_regularizer": null, "recurrent_regularizer": null}, "class_name": "LSTM"}, {"config": {"rate": 0.2, "trainable": true, "name": "dropout_1"}, "class_name": "Dropout"}, {"config": {"name": "lstm_2", "recurrent_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "recurrent_dropout": 0.0, "stateful": false, "units": 100, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "return_sequences": false, "kernel_regularizer": null, "use_bias": true, "go_backwards": false, "return_state": false, "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "recurrent_activation": "hard_sigmoid", "activity_regularizer": null, "kernel_constraint": null, "trainable": true, "implementation": 0, "unit_forget_bias": true, "unroll": false, "activation": "tanh", "dropout": 0.0, "bias_regularizer": null, "recurrent_regularizer": null}, "class_name": "LSTM"}, {"config": {"rate": 0.2, "trainable": true, "name": "dropout_2"}, "class_name": "Dropout"}, {"config": {"kernel_regularizer": null, "use_bias": true, "name": "dense_1", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "bias_constraint": null, "activity_regularizer": null, "units": 2, "activation": "softmax", "trainable": true, "bias_regularizer": null}, "class_name": "Dense"}], "backend": "tensorflow", "class_name": "Sequential"}