{"class_name": "Sequential", "backend": "tensorflow", "config": [{"class_name": "LSTM", "config": {"activity_regularizer": null, "dropout": 0.0, "recurrent_dropout": 0.0, "go_backwards": false, "recurrent_activation": "hard_sigmoid", "bias_initializer": {"class_name": "Zeros", "config": {}}, "return_state": false, "bias_regularizer": null, "activation": "tanh", "batch_input_shape": [null, 80, 3], "trainable": true, "stateful": false, "recurrent_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "units": 100, "implementation": 0, "dtype": "float32", "use_bias": true, "name": "lstm_1", "bias_constraint": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "return_sequences": false, "unroll": false, "kernel_constraint": null, "kernel_regularizer": null, "unit_forget_bias": true, "recurrent_constraint": null}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "use_bias": true, "name": "dense_1", "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activation": "softmax", "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "kernel_constraint": null, "kernel_regularizer": null, "units": 2}}], "keras_version": "2.0.8"}