{"keras_version": "2.0.8", "backend": "tensorflow", "config": [{"config": {"activity_regularizer": null, "use_bias": true, "implementation": 0, "go_backwards": false, "dtype": "float32", "return_sequences": true, "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "lstm_1", "recurrent_constraint": null, "batch_input_shape": [null, 80, 3], "return_state": false, "bias_regularizer": null, "recurrent_activation": "hard_sigmoid", "unit_forget_bias": true, "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "kernel_regularizer": null, "units": 100, "stateful": false, "recurrent_regularizer": null, "recurrent_dropout": 0.0, "dropout": 0.0, "bias_constraint": null, "unroll": false, "activation": "tanh", "kernel_constraint": null}, "class_name": "LSTM"}, {"config": {"name": "dropout_1", "trainable": true, "rate": 0.2}, "class_name": "Dropout"}, {"config": {"activity_regularizer": null, "use_bias": true, "implementation": 0, "go_backwards": false, "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "return_sequences": false, "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "lstm_2", "recurrent_constraint": null, "return_state": false, "bias_regularizer": null, "recurrent_activation": "hard_sigmoid", "unit_forget_bias": true, "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "units": 100, "stateful": false, "recurrent_regularizer": null, "recurrent_dropout": 0.0, "dropout": 0.0, "bias_constraint": null, "unroll": false, "activation": "tanh", "kernel_constraint": null}, "class_name": "LSTM"}, {"config": {"name": "dropout_2", "trainable": true, "rate": 0.2}, "class_name": "Dropout"}, {"config": {"activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true, "trainable": true, "kernel_regularizer": null, "bias_regularizer": null, "units": 2, "name": "dense_1", "kernel_constraint": null, "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "bias_constraint": null, "activation": "softmax"}, "class_name": "Dense"}], "class_name": "Sequential"}