{"config": [{"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "stateful": false, "return_sequences": true, "use_bias": true, "recurrent_constraint": null, "recurrent_dropout": 0.0, "units": 100, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "go_backwards": false, "batch_input_shape": [null, 80, 3], "kernel_constraint": null, "implementation": 0, "recurrent_activation": "hard_sigmoid", "recurrent_regularizer": null, "activation": "tanh", "unroll": false, "activity_regularizer": null, "trainable": true, "dropout": 0.0, "dtype": "float32", "bias_regularizer": null, "bias_constraint": null, "return_state": false, "unit_forget_bias": true, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "name": "lstm_1"}, "class_name": "LSTM"}, {"config": {"rate": 0.2, "name": "dropout_1", "trainable": true}, "class_name": "Dropout"}, {"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "stateful": false, "return_sequences": false, "use_bias": true, "recurrent_constraint": null, "units": 100, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "go_backwards": false, "unroll": false, "kernel_constraint": null, "implementation": 0, "recurrent_activation": "hard_sigmoid", "recurrent_regularizer": null, "recurrent_dropout": 0.0, "activation": "tanh", "activity_regularizer": null, "trainable": true, "dropout": 0.0, "bias_regularizer": null, "bias_constraint": null, "return_state": false, "unit_forget_bias": true, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "name": "lstm_2"}, "class_name": "LSTM"}, {"config": {"rate": 0.2, "name": "dropout_2", "trainable": true}, "class_name": "Dropout"}, {"config": {"activation": "softmax", "activity_regularizer": null, "trainable": true, "use_bias": true, "units": 6, "bias_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "name": "dense_1", "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Dense"}], "backend": "tensorflow", "class_name": "Sequential", "keras_version": "2.0.8"}