{"backend": "tensorflow", "config": [{"config": {"unit_forget_bias": true, "recurrent_constraint": null, "go_backwards": false, "recurrent_regularizer": null, "kernel_constraint": null, "recurrent_activation": "hard_sigmoid", "return_state": false, "activation": "tanh", "trainable": true, "return_sequences": false, "dtype": "float32", "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "units": 100, "stateful": false, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "batch_input_shape": [null, 80, 3], "unroll": false, "use_bias": true, "recurrent_dropout": 0.0, "implementation": 0, "dropout": 0.0, "kernel_regularizer": null, "bias_regularizer": null, "name": "lstm_1", "activity_regularizer": null, "bias_constraint": null, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}}, "class_name": "LSTM"}, {"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "use_bias": true, "activation": "softmax", "kernel_regularizer": null, "trainable": true, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "name": "dense_1", "activity_regularizer": null, "bias_constraint": null, "units": 2}, "class_name": "Dense"}], "class_name": "Sequential", "keras_version": "2.0.8"}