{"keras_version": "2.0.8", "config": [{"class_name": "LSTM", "config": {"recurrent_regularizer": null, "use_bias": true, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "kernel_regularizer": null, "dtype": "float32", "implementation": 0, "unroll": false, "activation": "tanh", "activity_regularizer": null, "unit_forget_bias": true, "return_sequences": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dropout": 0.0, "trainable": true, "bias_constraint": null, "batch_input_shape": [null, 40, 3], "return_state": false, "stateful": false, "kernel_constraint": null, "recurrent_activation": "hard_sigmoid", "bias_regularizer": null, "units": 100, "name": "lstm_1", "recurrent_constraint": null, "go_backwards": false, "recurrent_dropout": 0.0, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}}}, {"class_name": "Dense", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "use_bias": true, "activation": "softmax", "bias_constraint": null, "bias_regularizer": null, "units": 6, "name": "dense_1", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "kernel_regularizer": null, "activity_regularizer": null, "kernel_constraint": null}}], "backend": "tensorflow", "class_name": "Sequential"}